#1) რა არის tag?
#Tag მოკლედ რომ ვთქვათ არის მეტობის და ნაკლებობის ნიშანი რომელიც იკავებს დიდ როლს მაგალითად რომ შევქმნათ html-ის საიტის ღილაკი საჭიროა გამოვიყენოთ
#ფუნქცია <button> </button>

#2)რა არის html-ი?
#html-ი არის ადგილი საიდანაც ვიწყებთ საიტის შექმნას ადვილათ რომ გავნიხილოთ ის არის საიტის ჩობნჩხი

#3) რა განსხვავებაა html-ის css-ის და java script-ის? 
#ადვილად რომ ვტქვათ 
#html-არის როგორც ვთქვით საიტის ჩონჩხი
#css-არის ადგილიმ სადაც ვაზლევთ უკვე საიტს ფერებს გადავაადგილლებთ ტექსტს და ასე შემდეგ ...
#java script- ჯავა სკრიპტში უკვე ვაძლევთ საიტას სხვადასხვა ფუნქციებს 
 
#4)რა არის p tag ?
#P თაგით საიტზე გამოგვაქვს ტექსტი რომ საიტზე გამოვიტანოთ ტექსტი საჭიროა გავწეროთ ასეთი კოდი <p>  </p>

# 5)რა არის button tag? 
# button-თაგით საიტზე გამოგვაქვს ღილაკი მაგალითად: თუ საიტზე გვინდა გამოვითანოტ ღილაკი მაშინ უნდა გავწეროთ ასეთი კოდი <button> </button>

#6) რაში ვიყენებთ <> - ამას html-ში?
#ეს ნიშანი არის Tag-ი რომელსაც დიდი როლი აქვს და მას ვიყენებთ ტექსტის,რილაკის,ტექსტის გასადიდებლად და ასე შემდეგ ...


