#1)რა არის Python?
#პითონი არის პროგრამირების ენა სადაც უშუალოდ ვწერთ კოდს.


#2)რომელი ბრძანება გამოიყენება ეკრანზე ტექსტის გამოსატანად Python-ში
#ეკრანზდე ტექსტის გამოსატანად გამოიყენება ბრზანება print("  ").


#3)რას აკეთებს print() ფუნქცია?
#print- ფუნქციას ვიყენებტ რაღაცის ეკრანზე გამოსატანად მაგალიტად თუ გვინდა რომ ეკრანზე გამოვიტანოთ 
#home მაშინ print-ფუნქციიტ ვწერთ print("home") .

#4)როგორ იწერება კომენტარი Python-ში?
#კომენტარი პიტონში იწერება #-ით.


#5)რა არის ცვლადი (variable)?
#ცვლადი აფრის ადგილი სადაც ინახება სახელი მაგალითად name=luka ეს არის---> ცვლადი.


#6)როგორ შევქმნათ ცვლადი Python-ში?
#როდესაც გვინდა python-ში ცვლადის შექმნა ვიყენებთ   =  მაგალითისთვის გვინდა შევქმნათ ცვლადი სადაც შევინახავთ ნივთს მაშინ ვწერთ item=box

#7)რას ნიშნავს = Python-ში?
#ჩვენ ვისწავლეთ რომ ცვლადის შესაქმნელად საჭიროა =  და აქედან გამომდინარე =  საჭიროა რომ შევქმნათ ცვლადი მაგალითად language=spanish.

#8)Python-ში დიდი და პატარა ასოები ერთნაირად ითვლება თუ არა?
#როდესაც python-ში ვწერთ კოდს დიდი ყურადღება ექცევა დიდ და პატარა ასოებს რადგან მაგალითისთვის დიდი ასოებიტ რომ დავწერო PRINT("  ")
#ამ შემთხვევაში პროგრამა ერორს გვაძლევს. 

#9)რას ნიშნავს integer Python-ში?
#pyton-ში integer-ი არის ციფრები მაგალითისთვის ესენია 10;20;45 ...

#10)რას ნიშნავს float Python-ში?
#python-ში float-ი არის მეატედი ციფრები მაგალითად 12,5;4,6  ...


#11)რას ნიშნავს string Python-ში?
#სტრინგი პითონში არის წინადადება რომ ელიც არის ჩასმული "  " ბრჭყალებში

#12)რას გამოიტანს ეს კოდი?

print(5 + 3) 
#ამ კოდს გამოაქვს პასუხად 8


#13)რას გამოიტანს ეს კოდი?

x = 10
print(x)
#ამ კოდს გამოაქვს პასუხად 10

#14)რას გამოიტანს ეს კოდი?

name = "Nika"
print("Hello", name)
#ამ კოდს გამოაქვს hello nika 

#15)რას აკეთებს input() ფუნქცია?
#input-ფუნქციას ვაკონტროლებთ ჩვენ და გავცემთ ბრძანებას რომელსაც ოუტპუთში ვასრულებტ მაგალითად name=input("ჩაწერეთ თქვენი სახელი")

#16)რას გამოიტანს ეს კოდი?
print(10 - 4)
#ამ კოდს პასუხად გამოაქვს 6

#17)რას გამოიტანს ეს კოდი?
a = 3
b = 4
print(a * b)
#ეს კოდი გვაძლევს 12

#18)რას გამოიტანს ეს კოდი?

x = 5
x = x + 3
print(x)
#ეს კოდი გამოიტანს X+3  -ს

#19)რას გააკეთებს ეს კოდი?
name = input("Enter your name: ")
print("Hello", name)

#ეს კოდი გვაძლევს ნებართვას რომ ჩავწეროთ output-ში სახელი მაგალიტად name = input("name = input("Enter your name:  ") გვძლევს ნებართვას რომ მივუწეროთ Enter your name:-ს 
#რამე სიტყვა ან ციფრი


#20)რა იქნება შედეგი?

a = 10
b = 5
print(a / b)
#ეს კოდი პასუხად მოგვცემს 2