# 2) კომენტარებით ახსენით რა არის slicing.

# 3) შექმენი სია fruits = ["ვაშლი", "ბანანი", "ატამი", "მსხალი", "ალუბალი"] და
# დაბეჭდე მესამე ელემენტი

# 4) შექმენი სია numbers = [10, 20, 30, 40, 50], შეცვალე მეორე ელემენტი 25-ით 
# და დაბეჭდე განახლებული სია
 
# 5) მომხმარებელს შეაყვანინე ინდექსი (`0`-დან `4`-მდე) და დაბეჭდე შესაბამისი 
# ელემენტი სიიდან colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "იასამნისფერი"]

# 6) შექმენი სია animals = ["ძაღლი", "კატა", "სპილო", "ვეფხვი", "ლომი"],
# შეცვალე ბოლო ელემენტი "გემი"-თ და დაბეჭდე სია
 
# 7) მომხმარებელს შეაყვანინე ინდექსი და ახალი ფერი, შეცვალე ამ ინდექსზე არსებული 
# ფერი სიაში colors = ["თეთრი", "შავი", "ნარინჯისფერი", "ვარდისფერი"]` 
# და დაბეჭდე განახლებული სია

#2) sasvaleba rom avigoot siis ragac nawili
#3)
fruits = ["ვაშლი", "ბანანი", "ატამი", "მსხალი", "ალუბალი"]
print(fruits[2])
#4)
numbers = [10, 20, 30, 40, 50]
numbers[1] = 25
print(numbers)  

#5)
colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "იასამნისფერი"]
index = int(input("შეიყვანე ინდექსი (0-დან 4-მდე): "))
if 0 <= index <= 4:
    print(colors[index])
else:
    print("araswoi index")

#6)
animals = ["ძაღლი", "კატა", "სპილო", "ვეფხვი", "ლომი"]
animals[-1] = "gemi"
print(animals)  

#7)
colors = ["თეთრი", "შავი", "ნარინჯისფერი", "ვარდისფერი"]
index = int(input("შეიყვანე ინდექსი: "))
new_color = input("შეიყვანე ახალი ფერი: ")
if 0 <= index < len(colors):
    colors[index] = new_color
    print(colors)
else:
    print("araswori index!")

    