# Level 16
# 1) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი. (any index)

# 2) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს. ბოლოს გამოიტანეთ სიაში მყოფი პირველი და მესამე მნიშვნელობა. (დადებითი index-ებით)

# 3) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დან 10-ის ჩათვლით ყველა ლუწ რიცხვს. ბოლოს გამოიტანეთ სიაში მყოფი მეორე და მეოთხე მნიშვნელობა. (აურყოფითი index-ებით)

#1)
my_list= ['apple', 'bananas', 'pear', 'dragonfruit', 'watermelon']
print(my_list[3])

#2)
cars= ['bmw', 'mercedes', 'audi', 'porshe','tesla']
print(cars[0])
print(cars[2])

#3)
even_numbers=[0,2,4,6,8,10]
print(even_numbers[-5])
print(even_numbers[-3])
