  # სია (List) არის მონაცემთა სტრუქტურა, რომელიც საშუალებას გვაძლევს
# ერთ ცვლადში შევინახოთ რამდენიმე მნიშვნელობა

# სიის შექმნა ხდება ფრჩხილებით [] 
names = ["გიორგი", "ანა", "დავით", "მარიამ"]

# Index არის რიცხვი რომელიც აჩვენებს ელემენტის პოზიციას სიაში
# Python ინდექსირება იწყება 0-დან



names = ["გიორგი", "ანა", "დავით", "მარიამ", "თემური", "ნინო", "ლევანი"]
print("საწყისი სია:", names)
names[1] = "სოფია"
names[5] = "ირაკლი"
print("შეცვლილი სია:", names)



age = 25      
name = "გიორგი"
students = ["გიორგი", "ანა", "დავით", 25, True]
