#2) კომენტარების სახით ჩამთვალეთ ყველა შედარებითი ოპერატორები და გააკეთეთ 5-5 ნაგალითი თითოეულზე.

#3) კომენტარების სახით ახსენით რა არის logical operators, ჩამოწერეთ თითოეული და განმარტეთ რომელი რა დროს რა შედეგს გვიბრუნებს.

#4) გააკეთეთ 3-3 მაგალითი logical operator-ებზე.

#5) მომხმარებელს შემოატანინეთ რიცხვი, შეინახეთ იგი ცვლადში და შეადარეთ იგი მეტია თუ არა თქვენს მიერ წინასწარ გამზადებულ რიცხვზე.

#6) მომხმარებელს შემოატანინეთ სახელი, შეინახეთ იგი ცვლადში და მკაცრად შეამოწმეთ უდრის თუ არა იგი თქვენს სახელს.

#7) მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ მეტია თუ არა იგი 18.
#2)comparison operators
print(45>34)
print(45>1)
print(477>34)
print(499>34)
print(45>5)
print(23<90)
print(23<908)
print(29<90)
print(234<900)
print(23<89)
print(20==20)
print(91==91)
print(29==29)
print(7==7)
print(34==34)
print(96 != 92)
print(9 != 90)
print(96 != 8)
print(6 != 7)
print(56 != 76)
#3)logical operators-გამოიყენება იმისთვის რომ რამოდენიმე პირობა ერთად შევამოწმოტ მაგალითებია:
print(10>5 or 34>90)
print(5<9 and 90>9)
#3)
print(10>8 or 34>7)
print(5<6 and 90>45)
print(10>3 or 34>12)
print(12>8 and 90>89)
print(23>9 or 90>1)
print(78<99 and 23>22)
#4)
nummber1=int(input("enter your nummber:"))
print(77<nummber1)
#5)
name=input("enter your name:")
print("luka"==name)
#6)
age=int(input("enter your age:"))
print(18<age)
