# 1) მომხმარებელს შემოატანინეთ თავისი სახელი, შეამოწმეთ თუ ის უდრის "davit"-ს, 
# მაშინ დაბეჭდეთ "გაუმარჯოს დავით". სხვა შემთხვევაში "შენ არ ხარ დავითი"

# 2) მომხმარებელს შემოატანინეთ ამინდი და თუ ის არის "მზიანი", დაბეჭდეთ
#  "ვივარჯიშებ გარეთ", სხვა შემთხვევაში თუ "მოღრუბლულია"-ა მაშინ დაბეჭდეთ "ვივარჯიშებ გარ
# ეთ ოღონდ მოგვიანებით", ხოლო სხვა დანარჩენ შემთხვევაში დაბეჭდეთ "საერთოდარ ვივარჯიშებ დღეს"


name=input('enter your name:')

if name == 'davit':
    print('hello davit')
else:
    print('you are not davit')

weather=input('დღეს როგორი ამინდია?')
if weather== 'მზიანი':
    print('ვივარჯიშებ გარეთ')
elif weather=='მოღრუბლულია':
   print('მოგვიანებიტ ვივარჯიშებ')
else:
print('არ ვივარჯისებ დღეს')
